In [6]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [7]:
df = pd.read_csv('train.csv', index_col='id')

In [11]:
df.sample(10)

       age           job   marital  ... euribor3m nr.employed    y
id                                  ...
8536    34           NaN  divorced  ...     4.120      5195.8   no
28728   29   blue-collar   married  ...     4.962      5228.1   no
9694    31        admin.    single  ...     4.021      5195.8   no
2170    44  entrepreneur   married  ...     4.864      5228.1   no
21873   28    technician   married  ...     4.856      5191.0   no
9763    43        admin.   married  ...     4.964      5228.1   no
32197   41        admin.   married  ...     4.961      5228.1   no
18146   69       retired   married  ...     0.715      5017.5  yes
2029    32        admin.    single  ...     4.857      5191.0   no
934     32    management   married  ...     4.964      5228.1   no

[10 rows x 21 columns]

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 37069 entries, 0 to 37068
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             37069 non-null  int64
 1   job             36773 non-null  object
 2   marital         37000 non-null  object
 3   education       35505 non-null  object
 4   default         29296 non-null  object
 5   housing         36176 non-null  object
 6   loan            36176 non-null  object
 7   contact         37069 non-null  object
 8   month           37069 non-null  object
 9   day_of_week     37069 non-null  object
 10  duration        37069 non-null  int64
 11  campaign        37069 non-null  int64
 12  pdays           37069 non-null  int64
 13  previous        37069 non-null  int64
 14  poutcome        37069 non-null  object
 15  emp.var.rate    37069 non-null  float64
 16  cons.price.idx  37069 non-null  float64
 17  cons.conf.idx   37069 non-null  float64
 18  euribor3m       37069 non-null  float64
 19  nr.employed     37069 non-null  float64
 20  y               37069 non-null  object
dtypes: float64(5), int64(5), object(11)
memory usage: 6.2+ MB

In [10]:
df.describe()

                age      duration  ...     euribor3m   nr.employed
count  37069.000000  37069.000000  ...  37069.000000  37069.000000
mean      40.023497    258.185492  ...      3.620484   5166.966047
std       10.412653    259.579105  ...      1.735310     72.360902
min       17.000000      0.000000  ...      0.634000   4963.600000
25%       32.000000    103.000000  ...      1.344000   5099.100000
50%       38.000000    180.000000  ...      4.857000   5191.000000
75%       47.000000    319.000000  ...      4.961000   5228.100000
max       98.000000   4918.000000  ...      5.045000   5228.100000

[8 rows x 10 columns]

In [12]:
df.describe(include='object')

           job  marital          education  ... day_of_week     poutcome      y
count    36773    37000              35505  ...       37069        37069  37069
unique      11        3                  7  ...           5            3      2
top     admin.  married  university.degree  ...         thu  nonexistent     no
freq      9364    22424              10967  ...        7735        31989  32893

[4 rows x 11 columns]